{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi", "Hello", "Hey", "Hi there", "Good morning", "Good afternoon",
          "Greetings", "What's up?", "How are you?"
        ],
        "responses": [
          "Hello! Welcome to Merojutta! How can I assist you today?", 
          "Hi there! Excited to help you explore Merojutta shoes!", 
          "Hey! How can I make your shoe shopping experience better?", 
          "Hello! Ready to step into style with Merojutta?"
        ],
        "context": [""]
      },
      {
        "tag": "goodbye",
        "patterns": [
          "bye", "goodbye", "see you later", "take care",
          "Catch you later", "Farewell", "See you soon"
        ],
        "responses": [
          "Goodbye! Happy stepping with Merojutta!", 
          "See you later! Come back for more stylish shoes!", 
          "Take care! Keep rocking those Merojutta vibes!", 
          "Farewell! We’ll be here when you need new kicks!"
        ],
        "context": [""]
      },
      {
        "tag": "thanks",
        "patterns": [
          "Thanks", "Thank you", "That's helpful", "Appreciate it", "Thanks a lot",
          "Thank you very much", "I appreciate your help"
        ],
        "responses": [
          "You're welcome! Happy to assist!", 
          "No problem! Glad to help you out!", 
          "Anytime! Thanks for choosing Merojutta!", 
          "My pleasure! Keep shining in our shoes!"
        ],
        "context": [""]
      },
      {
        "tag": "merojutta",
        "patterns": [
          "Can you provide details about Merojutta?",
          "What is Merojutta?",
          "Tell me about Merojutta.",
          "Could you describe Merojutta?",
          "Details about Merojutta shoe brand",
          "Information on Merojutta",
          "Can you give me some information about Merojutta?",
          "I'd like some information on Merojutta.",
          "Fill me in on Merojutta.",
          "Provide some insight into Merojutta.",
          "Brief me on Merojutta."
        ],
        "responses": [
          "Merojutta is Nepal’s first online footwear e-commerce platform, founded in 2015. Based in Kathmandu, it offers a wide range of stylish and durable shoes for men, women, and kids, including casual, formal, sports, and ethnic styles. Merojutta is committed to quality, affordability, and customer satisfaction, with free shipping on all orders and secure payment options.",
          "Founded in 2015, Merojutta is a Kathmandu-based online shoe retailer, revolutionizing footwear shopping in Nepal. It provides a diverse collection of shoes, from sneakers and loafers to sandals and formal shoes, catering to all ages and styles. Merojutta emphasizes quality craftsmanship and customer convenience with 24/7 support and free delivery.",
          "Merojutta, established in 2015 in Kathmandu, Nepal, is the country’s leading online footwear brand. Offering everything from sports shoes to elegant formal wear, Merojutta ensures high-quality products at affordable prices. With a focus on customer satisfaction, it provides secure payments, free shipping, and a seamless shopping experience."
        ],
        "context": [""]
      },
      {
        "tag": "mission",
        "patterns": [
          "What is the mission of Merojutta?",
          "Could you tell me about Merojutta’s mission?",
          "What does Merojutta aim to achieve?",
          "What are the goals of Merojutta?",
          "Describe the mission of Merojutta.",
          "Mission statement of Merojutta."
        ],
        "responses": [
          "Merojutta’s mission is to provide high-quality, stylish, and affordable footwear to customers across Nepal, making shoe shopping accessible and convenient.",
          "We aim to empower our customers with confidence and comfort through our diverse range of durable and fashionable shoes.",
          "Merojutta is committed to revolutionizing online footwear retail in Nepal by offering exceptional products and unparalleled customer service.",
          "Our goal is to be Nepal’s top choice for footwear, promoting quality, affordability, and innovation in every step."
        ],
        "context": [""]
      },
      {
        "tag": "vision",
        "patterns": [
          "What is the vision of Merojutta?",
          "Could you describe the vision of Merojutta?",
          "What does Merojutta aspire to achieve?",
          "What are the future goals of Merojutta?",
          "Describe the vision statement of Merojutta.",
          "Vision of Merojutta."
        ],
        "responses": [
          "Merojutta envisions becoming Nepal’s leading footwear brand, recognized for quality, style, and customer satisfaction.",
          "We aspire to create a seamless online shopping experience, offering innovative and trendy footwear for all.",
          "Merojutta aims to expand its reach globally while maintaining its commitment to affordability and quality craftsmanship.",
          "Our vision is to foster a community of confident, stylish individuals who step forward with Merojutta shoes, wherever they go."
        ],
        "context": [""]
      },
      {
        "tag": "products",
        "patterns": [
          "What products does Merojutta offer?",
          "Tell me about Merojutta’s shoes",
          "List of shoes at Merojutta",
          "What types of footwear are available?",
          "Available products at Merojutta"
        ],
        "responses": [
          "Merojutta offers a wide range of footwear including casual shoes, formal shoes, sports shoes, sneakers, sandals, loafers, and ethnic styles like mojaris for men, women, and kids. Explore our collection at www.merojutta.com!"
        ],
        "context": [""]
      },
      {
        "tag": "casual_shoes",
        "patterns": [
          "Tell me about casual shoes",
          "What are Merojutta’s casual shoes?",
          "Give me details on casual footwear at Merojutta",
          "Information about casual shoes",
          "Casual shoe details"
        ],
        "responses": [
          "Merojutta’s casual shoes are designed for comfort and style, perfect for everyday wear.",
          "Our casual collection includes sneakers, slip-ons, and loafers made with high-quality materials.",
          "These shoes offer durability and versatility, ideal for casual outings or relaxed settings."
        ],
        "context": [""]
      },
      {
        "tag": "formal_shoes",
        "patterns": [
          "Tell me about formal shoes",
          "What are Merojutta’s formal shoes?",
          "Give me details on formal footwear at Merojutta",
          "Information about formal shoes",
          "Formal shoe details"
        ],
        "responses": [
          "Merojutta’s formal shoes are crafted for elegance and professionalism, ideal for office or special occasions.",
          "The collection includes oxfords, loafers, and monk straps made from premium leather.",
          "These shoes combine style and comfort, ensuring you make a lasting impression."
        ],
        "context": [""]
      },
      {
        "tag": "sports_shoes",
        "patterns": [
          "Tell me about sports shoes",
          "What are Merojutta’s sports shoes?",
          "Give me details on sports footwear at Merojutta",
          "Information about sports shoes",
          "Sports shoe details"
        ],
        "responses": [
          "Merojutta’s sports shoes are built for performance, offering support and durability for active lifestyles.",
          "The range includes running shoes, training shoes, and outdoor sneakers with advanced cushioning.",
          "These shoes are designed to enhance comfort and agility during workouts or sports."
        ],
        "context": [""]
      },
      {
        "tag": "shipping",
        "patterns": [
          "What is Merojutta’s shipping policy?",
          "Tell me about shipping",
          "How does Merojutta handle shipping?",
          "Shipping details",
          "Free shipping at Merojutta?"
        ],
        "responses": [
          "Merojutta offers free shipping on all orders across Nepal, with delivery typically within 3-5 business days.",
          "We ensure secure packaging and reliable delivery. Check www.merojutta.com for more details.",
          "Shipping is free on all purchases, and you can track your order via our website."
        ],
        "context": [""]
      },
      {
        "tag": "returns",
        "patterns": [
          "What is the return policy?",
          "How can I return shoes?",
          "Tell me about Merojutta’s returns",
          "Return process at Merojutta",
          "Can I return my shoes?"
        ],
        "responses": [
          "Merojutta offers a 15-day return policy for unused shoes in original packaging. Contact support for a return request.",
          "To return, visit www.merojutta.com, fill out the return form, and ship the item back within 15 days.",
          "We accept returns for defective or incorrect items. Reach out to info@merojutta.com for assistance."
        ],
        "context": [""]
      },
      {
        "tag": "discounts",
        "patterns": [
          "Are there any discounts available?",
          "Discount options at Merojutta",
          "Do you offer sales?",
          "Discounts on Merojutta shoes",
          "How can I get a discount?"
        ],
        "responses": [
          "Merojutta offers seasonal discounts and promotions, with up to 50% off on select styles. Check our Sale collection at www.merojutta.com!",
          "Subscribe to our newsletter for exclusive offers and a 10% discount on your first order.",
          "Follow us on social media or visit our website for the latest deals and promotions."
        ],
        "context": [""]
      },
      {
        "tag": "contact",
        "patterns": [
          "How can I contact Merojutta?",
          "Contact details of Merojutta",
          "How to get in touch with Merojutta?",
          "Merojutta contact information",
          "Phone number of Merojutta",
          "Email address of Merojutta"
        ],
        "responses": [
          "You can reach Merojutta at +977-1-5551234 or email us at info@merojutta.com.",
          "For inquiries, call +977-1-5551234 or send an email to info@merojutta.com.",
          "Contact us via phone at +977-1-5551234 or email at info@merojutta.com for support.",
          "Visit www.merojutta.com for more contact details and 24/7 online support."
        ],
        "context": [""]
      }
    ]
  }